source/python-docutils/input.dot
digraph G {
    graph [
        fontname = "Bitstream Vera Sans"
        fontsize = 9
        ranksep = 0.2
        splines = ortho
    ]
    node [
        fontname = "Bitstream Vera Sans"
        fontsize = 9
        shape = "record"
    ]
    edge [
        arrowtail = empty
        dir = back
        fontname = "Bitstream Vera Sans"
        fontsize = 9
    ]

    TransformSpec [
        label = "{TransformSpec
        |
        |+ get_transforms()\l}"

        fillcolor = lightgrey
        style = filled
    ]
    Input [
        label = "{Input
        |# encoding : str\l# source : File\l# source_path : str\l# default_source_path : str\l
        |+ read() : str\l# decode(str) : str\l}"
    ]

    NullInput [
        label = "{NullInput
        |# default_source_path : str\l
        |+ read() : str\l}"
    ]
    StringInput [
        label = "{StringInput
        |# default_source_path : str\l
        |+ read() : str\l}"
    ]
    FileInput [
        label = "{FileInput
        |# default_source_path : str\l
        |+ read() : str\l- readlines() : list\l- close()\l}"
    ]
    DocTreeInput [
        label = "{DocTreeInput
        |- default_source_path : str\l
        |+ read() : str\l}"
    ]

    node [
        shape = none//circle
        label = ""
        height = 0
        width = 0
    ]
    { rank = same; a, b, c, d, e }

    // inheritance hierarchy
    edge [
        arrowtail = empty
        dir = back
    ]
    TransformSpec -> Input
    //Input -> NullInput, StringInput, FileInput, DocTreeInput
    Input -> c

    edge [ dir = none; arrowtail = none; arrowhead = none]
    a -> b [ minlen = 6.0 ]
    b -> c -> d
    d -> e [ minlen = 6.0 ]
    a -> NullInput
    b -> StringInput
    d -> FileInput
    e -> DocTreeInput
}
